huskyroboticsteam/Science_Sensor_Board/testing_sensors/CO2 PSoC/CO2/CO2.cydsn/codegentemp/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.4
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2020 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "Output_Pin_0.h"
#include "Output_Pin_0_aliases.h"
#include "Output_Pin_1.h"
#include "Output_Pin_1_aliases.h"
#include "Input_Pin_0.h"
#include "Input_Pin_0_aliases.h"
#include "Input_Pin_1.h"
#include "Input_Pin_1_aliases.h"
#include "Input_0_Int.h"
#include "Input_1_Int.h"
#include "Comp_0.h"
#include "CompP_0.h"
#include "CompP_0_aliases.h"
#include "CompM_0.h"
#include "CompM_0_aliases.h"
#include "Comp_1.h"
#include "CompP_1.h"
#include "CompP_1_aliases.h"
#include "CompM_1.h"
#include "CompM_1_aliases.h"
#include "LPComp_Int.h"
#include "Wakeup_Pin.h"
#include "Wakeup_Pin_aliases.h"
#include "Wakeup_Pin_Int.h"
#include "Timer_Int.h"
#include "Timer_Pin.h"
#include "Timer_Pin_aliases.h"
#include "CapSense.h"
#include "CapSense_CSHL.h"
#include "CapSense_TunerHelper.h"
#include "CapSense_SMS.h"
#include "CapSense_PVT.h"
#include "CapSense_IP.h"
#include "IDAC_8bit_Out.h"
#include "IDAC_8bit_Out_aliases.h"
#include "IDAC_7bit_In.h"
#include "IDAC_7bit_In_aliases.h"
#include "IDAC_8bit.h"
#include "IDAC_7bit.h"
#include "ADC_EOC_Int.h"
#include "ADC_2_Buffer.h"
#include "ADC_3_Buffer.h"
#include "ADC_0.h"
#include "ADC_0_aliases.h"
#include "ADC_1P.h"
#include "ADC_1P_aliases.h"
#include "ADC_1M.h"
#include "ADC_1M_aliases.h"
#include "ADC_2.h"
#include "ADC_2_aliases.h"
#include "ADC_3.h"
#include "ADC_3_aliases.h"
#include "ADC.h"
#include "Clock_1MHz.h"
#include "PWM_0_Int.h"
#include "PWM_0_Out.h"
#include "PWM_0_Out_aliases.h"
#include "PWM_1_Out.h"
#include "PWM_1_Out_aliases.h"
#include "PWM_2_Out.h"
#include "PWM_2_Out_aliases.h"
#include "Timer.h"
#include "PWM_2.h"
#include "PWM_1.h"
#include "PWM_0.h"
#include "SPI.h"
#include "SPI_SPI_UART.h"
#include "SPI_PINS.h"
#include "SPI_SPI_UART_PVT.h"
#include "SPI_PVT.h"
#include "SPI_BOOT.h"
#include "I2CS.h"
#include "I2CS_I2C.h"
#include "I2CS_PINS.h"
#include "I2CS_I2C_PVT.h"
#include "I2CS_PVT.h"
#include "I2CS_BOOT.h"
#include "UART.h"
#include "UART_SPI_UART.h"
#include "UART_PINS.h"
#include "UART_SPI_UART_PVT.h"
#include "UART_PVT.h"
#include "UART_BOOT.h"
#include "CapSense_SampleClk.h"
#include "CapSense_Sns_aliases.h"
#include "CapSense_SenseClk.h"
#include "ADC_IRQ.h"
#include "ADC_intClock.h"
#include "SPI_SCBCLK.h"
#include "SPI_ss_s.h"
#include "SPI_ss_s_aliases.h"
#include "SPI_miso_s.h"
#include "SPI_miso_s_aliases.h"
#include "SPI_sclk_s.h"
#include "SPI_sclk_s_aliases.h"
#include "SPI_mosi_s.h"
#include "SPI_mosi_s_aliases.h"
#include "I2CS_SCBCLK.h"
#include "I2CS_sda.h"
#include "I2CS_sda_aliases.h"
#include "I2CS_scl.h"
#include "I2CS_scl_aliases.h"
#include "I2CS_SCB_IRQ.h"
#include "UART_SCBCLK.h"
#include "UART_tx.h"
#include "UART_tx_aliases.h"
#include "UART_rx.h"
#include "UART_rx_aliases.h"
#include "core_cm0_psoc4.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cyPm.h"
#include "cytypes.h"
#include "cypins.h"
#include "CyDMA.h"
#include "CyLFClk.h"
#include "cy_em_eeprom.h"

/*[]*/

